{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0096\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "trainable": true}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activation": "linear", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 24, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activation": "linear", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 36, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activation": "linear", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 48, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 64, "border_mode": "same", "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 64, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_5", "trainable": true, "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 80, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": 64, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 40, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": 80, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 16, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": 40, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 10, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": 16, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "trainable": true}, "class_name": "Dense"}, {"config": {"output_dim": 1, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": 10, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}